/* 
  title: 文章列表显示的标题
  name: 用于路由拼接url，与oss存储的对象名称相同
*/

export const postsList = [
  {
    title: '我就是在🐷厂饿死，也不做什么IDP规划',
    name: 'IDP规划',
    date: '2018-10-06',
    tags: ['实习'],
    categories: '扯淡',
    description: '真香',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/IDP%E8%A7%84%E5%88%92.md',
  },
  {
    title: '仓鼠的30天实习生活',
    name: '仓鼠的30天实习生活',
    date: '2018-08-11',
    tags: ['实习'],
    categories: '扯淡',
    description: '为什么我不能导出用大脑yy出的ppt？我想的可好了',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E4%BB%93%E9%BC%A0%E7%9A%8430%E5%A4%A9%E5%AE%9E%E4%B9%A0%E7%94%9F%E6%B4%BB.md',
  },
  {
    title: '某厂摸鱼小结——第一周',
    name: '摸鱼第一周',
    date: '2018-07-22',
    tags: ['实习'],
    categories: '扯淡',
    description: '现在就觉得，学习真踏马开心啊【你这就很不行】',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E6%91%B8%E9%B1%BC%E7%AC%AC%E4%B8%80%E5%91%A8.md',
  },
  {
    title: '图像处理初见！——水波纹',
    name: '水波纹',
    date: '2018-06-12',
    tags: ['图像处理', '水波纹'],
    categories: '前端',
    description: '这个天mac真是烫手啊，水波倒是看起来很清凉shiiiiit',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E6%B0%B4%E6%B3%A2%E7%BA%B9.md',
  },
  {
    title: '弹一弹#3 分离轴定理拯救碰撞检测！',
    name: '分离轴与碰撞检测',
    date: '2018-06-07',
    tags: ['碰撞检测', '分离轴定理', '弹一弹'],
    categories: '前端',
    description: '赞美太阳！！！',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E5%88%86%E7%A6%BB%E8%BD%B4%E4%B8%8E%E7%A2%B0%E6%92%9E%E6%A3%80%E6%B5%8B.md',
  },
  {
    title: '弹一弹#2 方块与圆の碰撞物语',
    name: '圆&矩形碰撞检测',
    date: '2018-05-03',
    tags: ['碰撞检测', '四叉树', '弹一弹'],
    categories: '前端',
    description: '再次有力论证了高中数学的重要性',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E5%9C%86%26%E7%9F%A9%E5%BD%A2%E7%A2%B0%E6%92%9E%E6%A3%80%E6%B5%8B.md'
  },
  {
    title: '弹一弹#1 碰撞检测效率与四叉树',
    name: '碰撞检测效率与四分树',
    date: '2018-04-26',
    tags: ['碰撞检测', '四叉树', '弹一弹'],
    categories: '前端',
    description: '不知道如何优化碰撞检测的效率，那还算什么游戏玩家！',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E7%A2%B0%E6%92%9E%E6%A3%80%E6%B5%8B%E6%95%88%E7%8E%87%E4%B8%8E%E5%9B%9B%E5%88%86%E6%A0%91.md'
  },
  {
    title: '俺的春招总结',
    name: '俺的春招总结',
    date: '2018-04-24',
    tags: ['实习'],
    categories: '前端',
    description: '试图做一点微小的贡献( º﹃º )',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E4%BF%BA%E7%9A%84%E6%98%A5%E6%8B%9B%E6%80%BB%E7%BB%93.md'
  },
  {
    title: '网易前端实习现场面筋',
    name: '网易前端实习面筋',
    date: '2018-04-18',
    tags: ['面经', '实习'],
    categories: '前端',
    description: '我的烤面筋，可得劲儿啦！！【好了现在可以天天看到自个儿有多菜了】',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E7%BD%91%E6%98%93%E5%89%8D%E7%AB%AF%E5%AE%9E%E4%B9%A0%E9%9D%A2%E7%AD%8B.md'
  },
  {
    title: '柏林噪声（perlin noise）都是怪物么！',
    name: '柏林噪声',
    date: '2018-03-30',
    tags: ['计算机图形', '噪声'],
    categories: '前端',
    description: '论美妙的随机是如何创造的！！',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E6%9F%8F%E6%9E%97%E5%99%AA%E5%A3%B0.md'
  },
  {
    title: '聊聊前端框架——尤雨溪',
    name: '聊聊前端框架',
    date: '2018-01-29',
    tags: ['框架'],
    categories: '前端',
    description: '并非博客，只是live的笔记【逃】',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E8%81%8A%E8%81%8A%E5%89%8D%E7%AB%AF%E6%A1%86%E6%9E%B6.md'
  },
  {
    title: '数学没学好，动画没头脑——transform篇',
    name: 'greensock-transform-rotate值',
    date: '2017-12-19',
    tags: ['transform', '三角函数', 'rotate', 'matrix矩阵'],
    categories: '前端',
    description: '在俺的《当我们讨论动画时，我们在讨论什么——transform篇》水文中，对于transform属性的matrix值，我曾写下了这样的话：“我们可以方便的从`rotate`值计算出`matrix`值，但是想要反过来（主要是获得rotate值，涉及到三角函数）却很不精确，暂时不考虑这种方法”。我之所以能如此大言不惭的得出这个结论，大概是因为 velocity.js 没有对 rotate 做足够的优化，我也就想着“连如此知名的动画库都没有做，大概是没有好的解决方法吧”，心安理得的将这个问题搁置一边了...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/greensock-transform-rotate%E5%80%BC.md'
  },
  {
    title: '前端帝国4：基地前奏',
    name: '前端帝国4：基地前奏',
    date: '2017-12-12',
    tags: ['总结'],
    categories: '扯淡',
    description: '在昨天小填了一下React的坑后，陷入了贤者模式，感觉就是第一波开荒结束，终于要在不同的职业之间做出选择。不过在选择成为 法师 / 刺客 / 战士 / 游侠 / 召唤师 等等之前，还是回顾一下从16年3月开始，到目前为止的21个月，我到底刷了什么怪吧（在这里要感谢我的书签栏，大概是我唯一比较有条理的东西）...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E5%89%8D%E7%AB%AF%E5%B8%9D%E5%9B%BD4%EF%BC%9A%E5%9F%BA%E5%9C%B0%E5%89%8D%E5%A5%8F.md'
  },
  {
    title: '循环，还有这种操作！？——es6补充',
    name: 'js-循环-es6',
    date: '2017-10-22',
    tags: ['es6', '循环'],
    categories: '前端',
    description: '缘，妙不可言——开始系统梳理es6后，发现关于循环的知识点又有了不少补充，正好填一下上次的坑嘛【抖】，本文有大量部分直接摘于《es6标准入门》',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/js-%E5%BE%AA%E7%8E%AF-es6.md'
  },
  {
    title: '《试图了解XSS注入，却发现了奇妙的基础问题！》',
    name: 'xss-基础',
    date: '2017-09-26',
    tags: ['xss', 'js'],
    categories: '前端',
    description: 'web安全，xss注入，blablabla......相关的博文看了不少，感觉相当单纯，不就是script嘛！转义嘛！结果自己尝试时又是喜闻乐见地发现，注入还没看多少，基础问题暴露一堆...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/xss-%E5%9F%BA%E7%A1%80.md'
  },
  {
    title: 'js对象克隆之谜',
    name: 'js对象克隆之谜',
    date: '2017-08-26',
    tags: ['js'],
    categories: '前端',
    description: '如何在js中获得一个克隆对象，可以说是喜闻乐见的话题了。相信大家都了解引用类型与基本类型，也都知道有种叫做深拷贝的东西，传说深拷贝可以获得一个克隆对象！那么像我这样的萌新自然就去学习了一波，我们能找到的代码基本都是这样的...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/js%E5%AF%B9%E8%B1%A1%E5%85%8B%E9%9A%86%E4%B9%8B%E8%B0%9C.md'
  },
  {
    title: '循环，还有这种操作！？',
    name: 'js-循环',
    date: '2017-08-15',
    tags: ['循环'],
    categories: '前端',
    description: '虽说已经看了n遍相关博文，但在实际操作中各种循环的操作实在是令人摸不着头脑，系统整理一回【拍桌】，简单 for 循环一般只适用于数组，最为常见的一种写法...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/js-%E5%BE%AA%E7%8E%AF.md'
  },
  {
    title: '键盘Tab与鼠标Click————可访问性与美观的平衡点',
    name: 'keybord-Tab-Click-可访问性-美观',
    date: '2017-07-18',
    tags: ['css'],
    categories: '前端',
    description: '作为重视可访问性与还原度的开发者，如何处理被focus的元素的outline可以说是逼死强迫症：outline:none显然太不优雅，对于使用tab键来定位的用户直接就是抓瞎。但是不作处理，在Click时就会产生蓝色outline边框，容易打破页面整体风格。。在折腾了很久后，俺并未能完全解决问题，不过找到了一个可以参考的平衡点...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/keybord-Tab-Click-%E5%8F%AF%E8%AE%BF%E9%97%AE%E6%80%A7-%E7%BE%8E%E8%A7%82.md'
  },
  {
    title: '前端系漫游指南',
    name: '前端系漫游指南',
    date: '2017-07-18',
    tags: ['指南'],
    categories: '前端',
    description: '这份指南纯粹是某人的自嗨产物，因为有不少人会来问他前端该如何入门种种，于是他就自己对于前端的认知整合了这玩意儿，仅代表个人意见，供以参考...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E5%89%8D%E7%AB%AF%E7%B3%BB%E6%BC%AB%E6%B8%B8%E6%8C%87%E5%8D%97.md'
  },
  {
    title: '当我们讨论动画时，我们在讨论什么———color篇',
    name: '动画-color',
    date: '2017-04-30',
    tags: ['动画', 'color'],
    categories: '前端',
    description: '除了上篇的transform动画需要特殊处理，还有一个大头就是属性值为颜色的处理。不同于transform，属性值为颜色的属性可以有很多种，而颜色属性值又有rgb、hsl、rgba甚至十六进制等多种表示方式，意味着两者对属性名、属性值分离的逻辑也是不同的，再加上对普通属性处理的逻辑，至少有三种不同的分离逻辑...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E5%8A%A8%E7%94%BB-color.md'
  },
  {
    title: '当一只菜鸡参加Hackathon',
    name: 'hackFire感想',
    date: '2017-04-24',
    tags: ['blablabla'],
    categories: '扯淡',
    description: '这周末参加了学校的hackathon，虽然在时长上不到24h，但没有意料到的是，此次体验后，俺会对产品开发和技术协作有了一些全新认识...在思考如何做一款原创性，解决痛点型的产品时，首先需要考虑的是什么？当然是它解决痛点的方式——对于大多数产品，这个方式可能真的仅仅是一个非常具体的点...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/hackFire%E6%84%9F%E6%83%B3.md'
  },
  {
    title: '当我们讨论动画时，我们在讨论什么——transform篇',
    name: '动画-transform',
    date: '2017-04-19',
    tags: ['transform', '动画'],
    categories: '前端',
    description: '基本完成了IFE的动画库任务,内心是崩溃的。JS补间动画的原理的确很简单，但在实现过程中，才意识到以前用的成熟的动画库，做了多少的工作...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E5%8A%A8%E7%94%BB-transform.md'
  },
  {
    title: '俺的colorPicker制作思路',
    name: 'colorPicker',
    date: '2017-04-09',
    tags: ['IFE2017', 'js', 'color'],
    categories: '前端',
    description: '说实话，一开始看到这个任务内心是相当懵比的——主要就是有两个点一下子没有头绪，但说实话，只要get到这两点的思路，这个任务也就完成了一半了。接下来俺就具体展开一下...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/colorPicker.md'
  },
  {
    title: 'js设计模式——单例模式',
    name: '单例模式',
    date: '2016-11-28',
    tags: ['设计模式', '单例模式', 'JavaScript'],
    categories: '前端',
    description: '单例模式应该是我最早接触的设计模式之一，尽管如此，前两天在写IFE的任务时还是懵比了好一阵，他喵的还是总结一下比较好...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/%E5%8D%95%E4%BE%8B%E6%A8%A1%E5%BC%8F.md'
  },
  {
    title: 'linux下使用hexo+git pages搭建博客的几个小坑',
    name: 'hexo+gitPages',
    date: '2016-11-27',
    tags: ['hexo', 'git'],
    categories: '博客',
    description: '其实好早就想搭个博客，不过由于不熟悉服务器端迟迟没有动手。而最近发现有不少基于git pages托管服务的博客，于是自己也搞了一个试试，发现意外的不错（不过要是以后换电脑可能还要重新配置？），作为练手的博文，总结一下搭建过程中几个小坑好了...',
    url: 'http://hukua-blog.oss-cn-beijing.aliyuncs.com/posts/hexo%2BgitPages.md'
  },
];